Tekla.Structures.Internal.ConnectUploads.Project
Represents a project containing uploads to Connect.

Tekla.Structures.Internal.ConnectUploads.Project.Id
Gets or sets the project ID.

Tekla.Structures.Internal.ConnectUploads.Project.Uploads
Gets or sets the list of uploads associated with the project.